# MinimumLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RouteAnalysisSettings..::..MinimumLength Property
RouteAnalysisSettings Class See Also
---
The constant storing minimum allowed length of path of travel
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public double MinimumLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MinimumLength As Double
	Get
```

Visual C++
---
```text
public:
property double MinimumLength {
	double get ();
}
```

# See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace